nxp-mcuxpresso/mcux-soc-svd/MCXA537/MCXA537.xml
        <register>
          <name>CMDL7</name>
          <description>Command Low Buffer Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input Channel Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_CH0</name>
                  <description>Select CH0A.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH1</name>
                  <description>Select CH1A.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH2</name>
                  <description>Select CH2A.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH3</name>
                  <description>Select CH3A.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_4</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_5</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_6</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_7</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_8</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_9</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_10</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_11</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_12</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_13</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_24</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_25</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_26</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_27</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_28</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_29</name>
                  <description>Select corresponding channel CHnA.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH30</name>
                  <description>Select CH30A.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH31</name>
                  <description>Select CH31A.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTYPE</name>
              <description>Conversion Type</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ENDED_A_SIDE_CHANNEL</name>
                  <description>Single-Ended Mode. Only A side channel is converted.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Select Resolution of Conversions</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_12_BITS</name>
                  <description>Standard resolution. Single-ended 12-bit conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_16_BITS</name>
                  <description>High resolution. Single-ended 16-bit conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDH7</name>
          <description>Command High Buffer Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPEN</name>
              <description>Compare Function Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED_ALWAYS_STORE_RESULT</name>
                  <description>Compare disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_RESULT_STORE_IF_TRUE</name>
                  <description>Compare enabled. Store on true.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_RESULT_KEEP_CONVERTING_UNTIL_TRUE_STORE_IF_TRUE</name>
                  <description>Compare enabled. Repeat channel acquisition (sample/convert/compare) until true.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT_TRIG</name>
              <description>Wait for Trigger Assertion before Execution.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>This command will be automatically executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The active trigger must be asserted again before executing this command.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LWI</name>
              <description>Loop with Increment</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Auto channel increment disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Auto channel increment enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Sample Time Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_3p5</name>
                  <description>Minimum sample time of 3.5 ADCK cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5p5</name>
                  <description>3.5 + 21 ADCK cycles; 5.5 ADCK cycles total sample time.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_7p5</name>
                  <description>3.5 + 22 ADCK cycles; 7.5 ADCK cycles total sample time.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_11p5</name>
                  <description>3.5 + 23 ADCK cycles; 11.5 ADCK cycles total sample time.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_19p5</name>
                  <description>3.5 + 24 ADCK cycles; 19.5 ADCK cycles total sample time.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_35p5</name>
                  <description>3.5 + 25 ADCK cycles; 35.5 ADCK cycles total sample time.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_67p5</name>
                  <description>3.5 + 26 ADCK cycles; 67.5 ADCK cycles total sample time.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_131p5</name>
                  <description>3.5 + 27 ADCK cycles; 131.5 ADCK cycles total sample time.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGS</name>
              <description>Hardware Average Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>Single conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_2</name>
                  <description>2 conversions averaged.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_4</name>
                  <description>4 conversions averaged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_8</name>
                  <description>8 conversions averaged.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_16</name>
                  <description>16 conversions averaged.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_32</name>
                  <description>32 conversions averaged.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_64</name>
                  <description>64 conversions averaged.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_128</name>
                  <description>128 conversions averaged.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_256</name>
                  <description>256 conversions averaged.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_512</name>
                  <description>512 conversions averaged.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop Count Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_EXEC_1x</name>
                  <description>Looping not enabled. Command executes 1 time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_2x</name>
                  <description>Loop 1 time. Command executes 2 times.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_3x</name>
                  <description>Loop 2 times. Command executes 3 times.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_3</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_4</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_5</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_6</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_7</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_8</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_9</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_10</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_11</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_12</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_13</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_14</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_15x</name>
                  <description>Loop 15 times. Command executes 16 times.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXT</name>
              <description>Next Command Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_NEXT_CMD_TERMINATE_ON_FINISH</name>
                  <description>No next command defined. Terminate conversions at completion of current command. If lower priority trigger pending, begin command associated with lower priority trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CMD1_NEXT</name>
                  <description>Select CMD1 command buffer register as next command.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_2</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_3</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_4</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_5</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_6</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CMD7_NEXT</name>
                  <description>Select CMD7 command buffer register as next command.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7</dimIndex>
          <name>CV%s</name>
          <description>Compare Value Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CVL</name>
              <description>Compare Value Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVH</name>
              <description>Compare Value High</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
